# 2.	Data Types
## 2.1	Variables
1. In Python, variables don't need explicit declaration to occupy memory space. 
2. The type of the variable will be decided after assigning the value to it.

In [1]:
counter = 10.00 #float type variable 
miles = 109 #integer type variable 
name = "Saeed" #string type variable

#print all values 
print (counter) 
print (miles)
print (name)

10.0
109
Saeed

## 2.2	Numbers

1. This data type stores numeric values.
2. They are immutable data types (Means changing the value of Number data type will results in a newly allocated object).

In [2]:
2 #integer

2

In [3]:
2+3+8 #integer

13

In [4]:
2.3+5.5+9.9 #float

17.7

In [5]:
2**6 #exponent

64

## 2.3	Strings
1. String data types are used to store words or combination of words having letters, numbers, special characters etc.
2.  It can be stored by enclosing within single qoutes and double qoutes also.
3.  Python doesn't support char data type. It will be as String of length one in Python.

In [6]:
name = 'Saeed' 
university = "UET"

print(name)
print(university)
print(name,university)

Saeed
UET
Saeed UET

#### Acess values in String
1. Python doesn't support Character data type. These are treated as Strings of length one.
2. Square brackets are used to access substrings.
3. We can access a specific character or range of characters from string.

In [7]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])
print("strinVariabale[2:9]:", stringVariable[2:9])

stringVariable[0]: H
stringVariable[1:5]: ello
strinVariabale[2:9]: llo Wor

####  Updating String
1. Value of the string can be updated by assigning a new value to it.
2. New value will be replaced with older. New value must be related (having same data type) to previous value of the string.
3. '+' operator will be used for this purpose like as follows:

In [8]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"

print("Updated string: ", stringVariable)

Updated string:  Hello Python

#### Delete String
To delete the value of the string, just delete its object (reference variable).

In [9]:
stringVariable = "Hello World"
print (stringVariable)

Hello World

In [10]:
del stringVariable
print (stringVariable)

NameError: name 'stringVariable' is not defined

#### String special operators
Some special operators are used in Python to assist the user. These are given below.
1. '+' operator is used for concatenation.
2. '*' used of Repetition
3. '[]' give the character of string at given index.
4. '[:]' is used to get a range of characters from string.
5. 'in' returns true if given character exists in string, otherwise false.
6. 'in' returns true if given character doesn't exists in string, otherwise false.

'+' operator is used for concatenation.

In [11]:
variable = "Hello" 
print(variable+ "Python")

HelloPython

In [12]:
variable = "Hello" 
print(variable+ " Python")

Hello Python

'*' used of Repetition

In [13]:
variable = "Hello" 
print(variable*3)

HelloHelloHello

In [14]:
variable = " Hello" 
print(variable*3)

 Hello Hello Hello

'[]' give the character of string at given index.

In [15]:
variable = "Hello" 
print(variable[1])

e

'[:]' is used to get a range of characters from string.

In [16]:
variable = "Hello" 
print(variable[1:3])

el

'in' returns true if given character exists in string, otherwise false.

In [17]:
variable = "Hello" 
print('H' in variable)

True

'in' returns true if given character doesn't exists in string, otherwise false.

In [18]:
variable = "Hello"
print('G' not in variable)

True

#### String formatting operator
One of the coolest feature is string formatting operator within print statement.

In [19]:
print ("My name is %s and age is %d Year!" % ("Saeed",21))

My name is Saeed and age is 21 Year!

# 2.4	Lists
1. It can be written as a list of comma-seperated values within square brackets.
2.  Multiple types of data can be stored in a List.
3.  Individual elements of a list can be changed (it can be read and write). List indices starts from 0 just like arrays.

In [20]:
list1 = ['Saeed','1880']
print(list1)

['Saeed', '1880']

## Accessing values in Lists
1. Square brackets are used to access the values of a list.
2. We can access a specific values or range of values from list.

In [21]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];

print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

## Updating Lists
1. We can update single or mupltiple elements of a list by giving slice on left hand of the assignment operator.
2. It can also be updated using append() function.

In [22]:
list1 = ['physics', 'chemistry', 1997, 2000]
list1[1] = "computer science"
print(list1)

list1.append('Computer Science')
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

## Delete List element
1. del statement is used to remove when you know the position or index of element to be deleted.
2. remove() function can be used when you don't know the position of element to be removed.

In [23]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1)
del list1[2];
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [24]:
list1 = ['physics', 'chemistry', 1997, 2000]
print (list1)
list1.remove('chemistry')
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

# 2.5	Dictionaries
1. It is same as array of objects having key and values in PHP. Each key is seperated by colon (:) from its value.
2. Each item is seperated with comma (,). Empty dictionary can be written as {}.
3. Keys are unique in dictionary but values may not. The values of the dictionary can be of any data type.
4. The keys must be of an immutable data type such as strings, numbers, or tuples.

## Accessing value in Dictionary

We can use the familiar square brackets along with the key to obtain its value. Following is a simple example

In [25]:
dict = {'Name':"Saeed", 'Depart': "Electrical", 'Batch': 2021}
print (dict['Name'])
print(dict['Depart'])

Saeed
Electrical

## Updating Dictionary
We can update already existing value in dictionary.
We can also add a new entry in dictionary.

In [26]:
dict = {'Name':"Saeed", 'Depart': "Electrical", 'Batch': 2021}
print (dict)
dict['Batch'] = "SP14" 
print (dict)

dict['University'] = "UET" 
print(dict)

{'Name': 'Saeed', 'Depart': 'Electrical', 'Batch': 2021}
{'Name': 'Saeed', 'Depart': 'Electrical', 'Batch': 'SP14'}
{'Name': 'Saeed', 'Depart': 'Electrical', 'Batch': 'SP14', 'University': 'UET'}

## Delete Dictionary Element
We can delete individual element of dicitionary and complete content of dictionary.
del is used for individual element
removal and clear() function is used to remove entire dictionary.

In [27]:
dict = {'Name':"Saeed", 'Depart': "Electrical", 'Batch': 2021}
print (dict)

del dict['Batch'] 
print (dict)

{'Name': 'Saeed', 'Depart': 'Electrical', 'Batch': 2021}
{'Name': 'Saeed', 'Depart': 'Electrical'}

In [28]:
dict = {'Name':"Saeed", 'Depart': "Electrical", 'Batch': 2021}
dict.clear()
print (dict)

{}

# 2.6	Tuples

1. It is same as list. The differences between tuples and lists are, the tuples cannot be changed.
2. Each item is comma (,) seperated.
3. Empty Tuple is shown as ().
4. To write a tuple containing a single value you have to include a comma (,) even though there is only one value. For Exampe: tup = (40,).
5. It can also have multiple data type values.
6. Like string indices, tuple indices start at 0, and they can be sliced, concatenated, and so on.

In [29]:
tup = (40 ,)
tup1 = (40)
print(tup)
print(tup1)

print(type(tup))
print(type(tup1))

(40,)
40
<class 'tuple'>
<class 'int'>

## Accessing values in Tuples
We can use the familiar square brackets along with the index to obtain its value.

In [30]:
tup = ('Math',98, 'C programming', '99')
print (tup)

print(tup[1])
print(tup[1:3])
print(tup[1:4])

('Math', 98, 'C programming', '99')
98
(98, 'C programming')
(98, 'C programming', '99')

## Updating Tuples
1. Tuples are immutable means we can't change it. It is read only.
2. We are able to take portions of tuples to make a new tuple.

In [31]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');

# So let's create a new tuple as follows
tup3 = tup1 + tup2;
print (tup3)
print(type(tup3))

(12, 34.56, 'abc', 'xyz')
<class 'tuple'>

In [32]:
# Following action is not valid for tuples 
tup1[0] = 100;

TypeError: 'tuple' object does not support item assignment

## Delete Tuple elements
1. Removing individual element in Tuple is not possible because they can't be updated.
2. del statment is used to remove entire Tuple.

In [33]:
tup = ('physics', 'chemistry', 1997, 2000); 
print (tup);

('physics', 'chemistry', 1997, 2000)

In [34]:
del tup;
print ("After deleting tup : "); 
print (tup);

After deleting tup :

NameError: name 'tup' is not defined

# 2.7	Sets
1. A set is collection of unordered items. Every element is unique (No duplicates).
2. Every element is immutable (can't be changed).
3. However, the set itself is mutable. We can add or remove items from it.
4. Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc. Empty set will be written as {}.
5. Each item in set will be comma (,) seperated.
6. We can make a set from a list using set() function. Data type can be found using type() function.
7. add() is used to add single value, update() is used for adding multiple values.
8. update() function can take tupe, strings, list or other set as argument. In all cases, duplicates will be avoided.
9. discard() and remove() are used to to delete particular item from set.
10. discard() will not raise an error if item doesn't exists in set.
11. remove() will raise an error if item doesn't exists in set.

In [35]:
#list
list1 = [1,2,3,4,5]
print(list1)
print (type(list1))

my_set = set(list1)
print(my_set)
print (type(my_set))

[1, 2, 3, 4, 5]
<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>

In [36]:
# set of integers
my_set = {1,2,3} 
print (my_set)

# set of mixed data types
my_set = {1,"Hello", 1.2,'C'}

{1, 2, 3}

In [37]:
# adding a single value 
my_set.add('D')

#adding multiple values my_set.update(list1) 
print (my_set)

{1, 1.2, 'D', 'C', 'Hello'}

In [38]:
my_set.discard('G') # it will not raise an error
print(my_set.discard('G'))

None

In [39]:
print(my_set.remove('G'))

KeyError: 'G'

# 3.	 Comparison Operators
These are used to compare values (string or numbers) and return true/false according to situation.

In [40]:
1<3

True

In [41]:
15 <= 23

True

In [42]:
'Saeed' == "Ahmad"

False

In [43]:
'Saeed' != "Ahmad"

True

In [44]:
(1==1) or (5 > 2)

True

In [45]:
(1 < 2) and (2 < 1)

False

# 4.	If-Else Statements
If-Else statments are used to execute a block of code depending on conditions. If block if condition is true otherwise else block.

In [46]:
if 25 % 2:
    print('Even')
else:
    print('Odd')

Even

# 5.	For and While Loop
Python has for and while loop for iteration, used when we want to perform a specific a task repeatedly.

In [47]:
#example of for loop 
fact = 1
N = 5
for i in range (1,N+1):
    fact*=i
print (fact)

120

In [48]:
#example of while loop 
a = 0
while a < 10:
    a = a+1 
    print(a)
    
print('Total sum is:',a)

1
2
3
4
5
6
7
8
9
10
Total sum is: 10

# 6. Functions
1. It is a block of organized and reusable code.
2. It is used to perform a single, related action.
3. It provides high modularity for your application.
4. It has a hight degree of code reusing.
The syntax is:

def functionname( parameters ): 
"function_docstring" 
function_suite
return [expression]

In [50]:
# Function definition is here 
def printme( str ):
#This prints a passed string into this function
    print (str)
    return;
# Now you can call printme function
printme("I'm first call to user defined function!: Muhammad Saeed")

I'm first call to user defined function!: Muhammad Saeed

# 7.	Lambda Functions
1. The creation of anonymous functions at runtime, using a construct called "lambda".
2. Lambda function doesn't include return statement, it always contains an expression which is returned.
3. This piece of code shows the difference between a normal function definition ("f") and a lambda function ("g"):

In [51]:
#Normal function 
def f (x):
    return x**2 
print (f(8))

64

In [52]:
#Lambda Function #lambda expressions
times3 = lambda var:var*3 
times3(10)
#lambda expressions: another way to write a function in line

30

## 7.1	Map()
1. Map() function is used with two arguments.
 Just like: seq = [1,2,3]
**r = map(func, seq)**
3. The first argument func is the name of a function and the second a sequence (e.g. a list).
4. seq. map() applies the function func to all the elements of the sequence seq. It returns a new list with the elements changed by func.

In [53]:
sentence = 'It is raining cats and dogs' 
words = sentence.split()
print (words)

lengths = map(lambda word: len(word), words) 
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

## 7.2	Filter()
1. The function filter(function, list) offers an elegant way to filter out all the elements of a list.
2. The function filter(f,l) needs a function f as its first argument. f returns a Boolean value, i.e. either True or False.
3. This function will be applied to every element of the list l.
4. Only if f returns True will the element of the list be included in the result list.

In [54]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib) 
print(fib)
print(result1)
list(result1)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
<filter object at 0x0000018A34F360E0>

[1, 1, 3, 5, 13, 21, 55]

In [55]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0, fib)
list (result2)

[0, 2, 8, 34]

# 8.	File I/O
In this section, we'll cover all basic I/O function(methods).

## Reading input from Keyboard
For reading input from keyboard, raw_input() method is used.
It reads only one line from standard input and returns it as a string.

In [141]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Saeed

Saeed

## I/O from or to Text File
In this scenario, we'll read and write to a text file.
1. r opens a file in read only mode.
2. r+ opens a file read and write mode.
3. w opens a file in write mode only.
4. a opens a file in append mode
5. a+ opens a file in append and read mode.

In [151]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read()  # to read specific content from start you can use read(12). It will read 12 characters from the start of file
print(str)

Hello Saeed!

In [152]:
# Close opened file 
fileOpen.close()

In [155]:
# Open a file to append
fileOpen = open("file.txt", "a+") 
fileOpen.write(" Information Technology Lahore"); 
fileOpen.close()

In [156]:
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characte rs from the start of file
print (string)
# Close opend file
fileOpen.close()

Hello Saeed! Information Technology Lahore Information Technology Lahore Information Technology Lahore

## File Position
1. tell() method tells the currenct position within the file.
2. seek() method changes the current file location.

In [161]:
# Open a file
fo = open("file.txt", "r+") 
str = fo.read(10);
print ("Read String is : \n", str)

# Check current position
position = fo.tell();
print ("Current file position : \n", position)

# Reposition pointer at the beginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print ("Again read String is : \n", str) # Close opend file
fo.close()

Read String is :
 Hello Saee
Current file position :
 10
Again read String is :
 Hello Saee

In [162]:
import os
# rename a file
os.rename("file.txt", "newfile.txt")

In [163]:
#remove file
os.remove("newfile.txt")

# 9.	Pandas Introduction
 Pandas is an open source library built on top of NumPy
1. It allows for fast analysis and data cleaning and preparation
2. It excels in proformance and productivity
3. It also has built-in visualization features
4. It can work with data from a wide variety of sources

# 10.	Series
1. A series is very similar to NumPy array.
2. Series is 1-D array labeled array capable of holding any type of data.
3. The difference between the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location
4. The axis labels are collectively referred to as the index.
5.  Following function is used to create a series:
    s= pd.Series(data,index = index)
6. In above function, data can be many different things:
      A python dict
      An ndarray
      A scalar value (For exmple: 5)
7. The passed index is a list of axis labels. So, this seperates into a few cases depending on what data is:

## 10.1	From ndarray
  If data is an ndarray, index must be the same length as data.
  If no index is passed, one will be created having values [0, ..., len(data) - 1].

In [164]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

"""following a fucntion is called from panas to create a series. data would be 5 random values and indexes are assigned a-e"""

s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e']) 
s

a    0.411296
b   -1.126808
c   -1.067699
d    1.140883
e    0.082683
dtype: float64

In [165]:
"""Following function will print the index and its datatype""" 
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [166]:
"""If we don't assign the index then it will of length having values [0.	len(data-1)]"""
pd.Series(np.random.randn(5))

0    0.187453
1   -2.121390
2    1.745138
3    0.497651
4   -0.824638
dtype: float64

## 10.2	From dict
1. If data is a dict, if index is passed the values in data corresponding to the labels in the index will be pulled out.
2. If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

In [167]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [168]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou t"""
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

## 10.3	From a scalar value
  If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [170]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of inde x"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## 10.4	Series is ndarray-like
  It acts very similarly to a ndarray.
  It is a valid argument to most NumPy functions. However, things like slicing also slice the index.

In [171]:
#we can access a value just like ndarray

#access single value
s[0]

C:\Users\Muhammad Saeed\AppData\Local\Temp\ipykernel_10612\706394606.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.float64(0.41129614184111424)

In [172]:
#access range of values 
s[:5]

a    0.411296
b   -1.126808
c   -1.067699
d    1.140883
e    0.082683
dtype: float64

In [173]:
""" Following example will return a range of values in series whose value is greater than the median of serie s"""
s[s > s.median()]

a    0.411296
d    1.140883
dtype: float64

In [174]:
"""Following example is return the values in series with indexes. 4,3,1 are the positions of the indexs For example: the index at 4,3,1 are e,d,b respectively"""
s[[4, 3, 1]]

C:\Users\Muhammad Saeed\AppData\Local\Temp\ipykernel_10612\3722420869.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e    0.082683
d    1.140883
b   -1.126808
dtype: float64

In [175]:
""" Following example returns the exponent values. just like e^a (here a is index and its respective data is placed here)"""
np.exp(s)

a    1.508772
b    0.324066
c    0.343799
d    3.129531
e    1.086198
dtype: float64

In [176]:
"""Following example will get the data of given index""" 
s['a']

np.float64(0.41129614184111424)

In [177]:
"""Following example will update the data of the given index"""
s['e'] = 12.
s # before updating e = 1.399281 but after updating e = 12.000000

a     0.411296
b    -1.126808
c    -1.067699
d     1.140883
e    12.000000
dtype: float64

In [178]:
""" Following will return true if 'e' is in the values of index otherwise false""" 
'e' in s

True

In [179]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """ 
s['f']

# This will create error

KeyError: 'f'

In [181]:
"""Using the get method, a missing label will return None or specified default"""
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

## 10.6 Vectorized operations and label alignment with Series
  When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary.  
  Series can also be passed into most NumPy methods expecting an ndarray.

In [289]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculate d as:
a = s['a'] + s['a']
b = s['b'] + s['b']
c = s['c'] + s['c']
d = s['d'] + s['d']
e = s['e'] + s['e']

"""
s + s

0   -0.358390
1   -0.687920
2    3.043626
3   -0.721479
4    0.100238
Name: something, dtype: float64

In [183]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca lculated as:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""

s * 2

a     0.822592
b    -2.253615
c    -2.135397
d     2.281766
e    24.000000
dtype: float64

In [184]:
s	=	pd.Series(np.random.randn(5),	name='something')
s

0   -0.179195
1   -0.343960
2    1.521813
3   -0.360740
4    0.050119
Name: something, dtype: float64

In [185]:
s.name #print the name attribute of series

'something'

In [187]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects.

s2 = s.rename("different") 
s2.name

'different'

#  11.	Data Frames
1. DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
2. Like Series, DataFrame accepts many different kinds of input:
      Dict of 1D ndarrays, lists, dicts, or Series
      2-D numpy.ndarray
      Structured or record ndarray
      A Series
      Another DataFrame
3. Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.
4. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame.
5. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.
6. If axis labels are not passed, they will be constructed from the input data based on common sense rules

## 11.1	From dict of Series or dicts
  The result index will be the union of the indexes of the various Series.  
  If there are any nested dicts, these will be first converted to Series.
  If no columns are passed, the columns will be the sorted list of dict keys.

In [190]:
""" A dict is created """ 
d = {
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}

"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it will be sorted list of dict keys"""

df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [191]:
""" a data frame will be constructed for given row labels""" 
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [192]:
"""following example shows a data frame when we give coloumn labels""" 
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [193]:
df.columns

Index(['one', 'two'], dtype='object')

## 11.2	From dict of ndarrays / lists
  The ndarrays must all be the same length.
  If an index is passed, it must clearly also be the same length as the arrays.  
  If no index is passed, the result will be range(n), where n is the array length.

In [197]:
"""followind examples shows that ndarray has same length""" 
d = {
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.]
}

"""column labels are not given so	the result will be range(n), where n is the array length"""
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [198]:
"""If indexs are given then it would be same length as arrays""" 
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

## 11.3	From a list of dicts

In [199]:
"""constructing data frame from a list of dicts""" 
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [200]:
"""passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [201]:
"""passing list of dicts as data and columns (columns labels)""" 
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

## 11.4	From a dict of tuples
You can automatically create a multi-indexed frame by passing a tuples dictionary

In [202]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

#"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## 11.5	Alternate Constructors

### DataFrame.from_dict
1. DataFrame.from_dict takes a dict of dicts or a dict of array-like sequences and returns a DataFrame.
2. It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order to use the dict keys as row labels.
### DataFrame.from_records
1. DataFrame.from_records takes a list of tuples or an ndarray with structured dtype.
2. Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as the index.

In [204]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

C:\Users\Muhammad Saeed\AppData\Local\Temp\ipykernel_10612\1682058321.py:1: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [205]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

### DataFrame.from_items
1. DataFrame.from_items works analogously to the form of the dict constructor that takes a sequence of (key, value) pairs, where the keys are column (or row, in the case of orient='index') names, and the value are the column values (or row values).
2. This can be useful for constructing a DataFrame with the columns in a particular order without having to pass an explicit list of columns

In [208]:
import pandas as pd
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [211]:
import pandas as pd

data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}

df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
print(df)

   one  two  three
A    1    2      3
B    4    5      6

## 11.6	Column selection, addition, deletion
  DataFrame can be treated semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations.

In [212]:
df['one'] # it is displaying data under coloumn 'one'

A    1
B    4
Name: one, dtype: int64

In [213]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [214]:
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [215]:
df #print a complete data frame

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [216]:
del df['two'] #delete a coloumn 'two' from data frame

In [217]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [218]:
df

   one   flag
A    1  False
B    4   True

In [219]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [220]:
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [222]:
"""following example will take values from coloumn one until give range and will populate the new coloumn""" 
df['one_trunc'] = df['one'][:2]

In [223]:
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [224]:
"""following function has three arguments.
First argument: index where new coloumn will be inserted. Second argument: label or title	of a new coloumn
Third argument: it will create a coloumn at specified position"""

df.insert(1, 'bar2', df['one'])

In [225]:
df

   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

## 11.7	Indexing / Selection
  Row selection, for example, returns a Series whose index is the columns of the DataFrame:

In [228]:
import pandas as pd

data = {
    'a': [10, 20, 30],
    'b': [40, 50, 60],
    'c': [70, 80, 90]
}

df = pd.DataFrame(data, index=['x', 'y', 'z'])

print(df.loc['y'])  # This selects row with index 'y'

a    20
b    50
c    80
Name: y, dtype: int64

In [229]:
df.iloc[2] #it will return the values of those coloumns that is > than 2

a    30
b    60
c    90
Name: z, dtype: int64

## 11.8	Data alignment and arithmetic
1. Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
2. Again, the resulting object will have the union of the column and row labels.

In [230]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [231]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [232]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0 -0.192317 -0.676756  0.115244 NaN
1 -0.365887  1.347093  0.729602 NaN
2  0.986572  2.902443  1.338657 NaN
3 -1.277111  1.296612 -0.913795 NaN
4 -2.139451 -0.140603 -0.732494 NaN
5  0.310530 -0.028137  0.175545 NaN
6 -0.417743  1.724251 -0.133625 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [233]:
In [126]: df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.607547  1.584931  0.799526 -1.094100
2  2.452155  3.625173  0.154105 -2.391552
3  1.702790  1.532527 -1.291162 -0.109866
4 -1.666527  0.702440 -0.221598 -0.989589
5  1.207165  0.263769  0.270408 -0.033990
6  0.463021  0.944345  0.323382 -1.047814
7  1.775038 -0.896981 -0.824319 -2.310798
8  0.969899  0.497861 -1.551763  0.437074
9  2.183755  0.139400 -0.225194 -0.477902

In [234]:
df * 5 + 2

           A          B         C          D
0  -2.114917  -0.239987  1.684086   7.824462
1   0.922819   7.684667  5.681715   2.353963
2  10.145856  17.885877  2.454612  -4.133299
3   6.399034   7.422648 -4.771726   7.275134
4 -10.447553   3.272211  0.576098   2.876516
5   3.920906   1.078860  3.036125   7.654514
6   0.200190   4.481739  3.300995   2.585391
7   6.760273  -4.724892 -2.437510  -3.729526
8   2.734576   2.249318 -6.074727  10.009830
9   8.803856   0.457013  0.558118   5.434951

In [235]:
1 / df

          A          B          C          D
0 -1.215091  -2.232155 -15.827113   0.858448
1 -4.641747   0.879559   1.358063  14.125784
2  0.613809   0.314745  10.998395  -0.815222
3  1.136613   0.922059  -0.738364   0.947843
4 -0.401685   3.930165  -3.511477   5.704401
5  2.602938  -5.428057   4.825670   0.884249
6 -2.778071   2.014716   3.843211   8.541306
7  1.050360  -0.743506  -1.126758  -0.872673
8  6.806648  20.054710  -0.619216   0.624233
9  0.734877  -3.240468  -3.467691   1.455625

In [236]:
df ** 4

           A           B         C         D
0   0.458738    0.040281  0.000016  1.841380
1   0.002154    1.670860  0.293982  0.000025
2   7.044771  101.897787  0.000068  2.264105
3   0.599169    1.383457  3.364476  1.238951
4  38.411032    0.004191  0.006577  0.000944
5   0.021784    0.001152  0.001844  1.635691
6   0.016789    0.060694  0.004584  0.000188
7   0.821575    3.272361  0.620408  1.724228
8   0.000466    0.000006  6.801919  6.585872
9   3.428786    0.009069  0.006916  0.222742

In [237]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [238]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [239]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [240]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [241]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [242]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

## 11.9	Transposing
  To transpose, access the T attribute (also the transpose function), similar to an ndarray

In [243]:
# only show the first 5 rows 
df[:5].T

          0         1         2         3         4
A -0.822983 -0.215436  1.629171  0.879807 -2.489511
B -0.447997  1.136933  3.177175  1.084530  0.254442
C -0.063183  0.736343  0.090922 -1.354345 -0.284780
D  1.164892  0.070793 -1.226660  1.055027  0.175303

In [244]:
dates = pd.date_range('20130101', periods=6)

In [245]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [246]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [247]:
df

                   A         B         C         D
2013-01-01 -1.449051  0.878814  0.032972 -0.372187
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797
2013-01-04  1.130596  1.224693  0.321386  0.808295
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844
2013-01-06 -0.641970 -1.982298 -0.288812 -1.391491

In [249]:
df2 = pd.DataFrame({ 'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'), 'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]), 'F' : 'foo' })

In [250]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [252]:
#Having specific dtypes 
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# 12. Viewing Data
We can view data / display data in different ways:
1. See the top & bottom rows of the frame
2. Selecting a single column
3. Selecting via [], which slices the rows
4. For getting a cross section using a label
5. Selecting on a multi-axis by labe
6. Showing label slicing, both endpoints are included
7. Reduction in the dimensions of the returned object
8.  For getting a scalar value
9.  For getting fast access to a scalar
10.  Select via the position of the passed integers
11.  By integer slices, acting similar to numpy/python
12.  By lists of integer position locations, similar to the numpy/python style
13.   For slicing rows explicitly
14.   For slicing columns explicitly
15.    For getting a value explicitly
16. For getting fast access to a scalar
17. Using a single column’s values to select data.
18. Selecting values from a DataFrame where a boolean condition is met.
19. Using the isin() method for filtering

In [253]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01 -1.449051  0.878814  0.032972 -0.372187
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797
2013-01-04  1.130596  1.224693  0.321386  0.808295
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844

In [254]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04  1.130596  1.224693  0.321386  0.808295
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844
2013-01-06 -0.641970 -1.982298 -0.288812 -1.391491

In [255]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [256]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [257]:
df.values # print values

array([[-1.4490508 ,  0.87881359,  0.03297216, -0.37218727],
       [ 0.60845223, -1.68311187, -0.74909274,  1.54449313],
       [ 0.13951822, -2.12179589, -1.1727673 , -1.45979663],
       [ 1.13059557,  1.22469329,  0.32138586,  0.80829521],
       [-0.56113884, -0.42430038, -1.49807746,  0.05284413],
       [-0.64197022, -1.98229776, -0.28881249, -1.39149108]])

In [259]:
# Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.449051    0.608452    0.139518    1.130596   -0.561139   -0.641970
B    0.878814   -1.683112   -2.121796    1.224693   -0.424300   -1.982298
C    0.032972   -0.749093   -1.172767    0.321386   -1.498077   -0.288812
D   -0.372187    1.544493   -1.459797    0.808295    0.052844   -1.391491

In [261]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.372187  0.032972  0.878814 -1.449051
2013-01-02  1.544493 -0.749093 -1.683112  0.608452
2013-01-03 -1.459797 -1.172767 -2.121796  0.139518
2013-01-04  0.808295  0.321386  1.224693  1.130596
2013-01-05  0.052844 -1.498077 -0.424300 -0.561139
2013-01-06 -1.391491 -0.288812 -1.982298 -0.641970

In [263]:
#Sorting by values 
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797
2013-01-06 -0.641970 -1.982298 -0.288812 -1.391491
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844
2013-01-01 -1.449051  0.878814  0.032972 -0.372187
2013-01-04  1.130596  1.224693  0.321386  0.808295

In [266]:
# Describe shows a quick statistic summary of your data 
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.128932 -0.684667 -0.559065 -0.136307
std    0.937543  1.476753  0.706148  1.194646
min   -1.449051 -2.121796 -1.498077 -1.459797
25%   -0.621762 -1.907501 -1.066849 -1.136665
50%   -0.210810 -1.053706 -0.518953 -0.159672
75%    0.491219  0.553035 -0.047474  0.619432
max    1.130596  1.224693  0.321386  1.544493

In [268]:
#Selecting a single column, which yields a Series, equivalent todf.A 
df['A']

2013-01-01   -1.449051
2013-01-02    0.608452
2013-01-03    0.139518
2013-01-04    1.130596
2013-01-05   -0.561139
2013-01-06   -0.641970
Freq: D, Name: A, dtype: float64

In [271]:
#Selecting via [], which slices the rows
df[0:3]

                   A         B         C         D
2013-01-01 -1.449051  0.878814  0.032972 -0.372187
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797

In [272]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797
2013-01-04  1.130596  1.224693  0.321386  0.808295

In [273]:
#Selecting on a multi-axis by label 
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.449051  0.878814
2013-01-02  0.608452 -1.683112
2013-01-03  0.139518 -2.121796
2013-01-04  1.130596  1.224693
2013-01-05 -0.561139 -0.424300
2013-01-06 -0.641970 -1.982298

In [274]:
#Showing label slicing, both endpoints are included 
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.608452 -1.683112
2013-01-03  0.139518 -2.121796
2013-01-04  1.130596  1.224693

In [275]:
# Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A    0.608452
B   -1.683112
Name: 2013-01-02 00:00:00, dtype: float64

In [276]:
# For getting a scalar value 
df.loc[dates[0],'A']

np.float64(-1.4490508034901701)

In [277]:
# For getting fast access to a scalar 
df.at[dates[0],'A']

np.float64(-1.4490508034901701)

In [278]:
# Select via the position of the passed integers
df.iloc[3]

A    1.130596
B    1.224693
C    0.321386
D    0.808295
Name: 2013-01-04 00:00:00, dtype: float64

In [279]:
# By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.130596  1.224693
2013-01-05 -0.561139 -0.424300

In [280]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.608452 -0.749093
2013-01-03  0.139518 -1.172767
2013-01-05 -0.561139 -1.498077

In [281]:
# For slicing rows explicitly 
df.iloc[:,1:3]

                   B         C
2013-01-01  0.878814  0.032972
2013-01-02 -1.683112 -0.749093
2013-01-03 -2.121796 -1.172767
2013-01-04  1.224693  0.321386
2013-01-05 -0.424300 -1.498077
2013-01-06 -1.982298 -0.288812

In [282]:
# For getting a value explicitly
df.iloc[1,1]

np.float64(-1.6831118655029507)

In [283]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.608452 -1.683112 -0.749093  1.544493
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797
2013-01-04  1.130596  1.224693  0.321386  0.808295

In [284]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.878814  0.032972       NaN
2013-01-02  0.608452       NaN       NaN  1.544493
2013-01-03  0.139518       NaN       NaN       NaN
2013-01-04  1.130596  1.224693  0.321386  0.808295
2013-01-05       NaN       NaN       NaN  0.052844
2013-01-06       NaN       NaN       NaN       NaN

In [285]:
# Using the isin() method for filtering: 
df2 = df.copy()

In [286]:
df2['E'] = ['one', 'one','two','three','four','three']

In [287]:
df2

                   A         B         C         D      E
2013-01-01 -1.449051  0.878814  0.032972 -0.372187    one
2013-01-02  0.608452 -1.683112 -0.749093  1.544493    one
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797    two
2013-01-04  1.130596  1.224693  0.321386  0.808295  three
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844   four
2013-01-06 -0.641970 -1.982298 -0.288812 -1.391491  three

In [288]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.139518 -2.121796 -1.172767 -1.459797   two
2013-01-05 -0.561139 -0.424300 -1.498077  0.052844  four